import random

class Strings:
    emoji = random.choice(["야발","어쩌라고요,,,,","☆*:.｡. o(≧▽≦)o .｡.:*☆","༼ ༎ຶ ෴ ༎ຶ༽","༼; ́༎ຶ ۝༎ຶ`༽","༼; ́༎ຶ + ༎ຶ༽]","(╬ ಠ 益ಠ)","ಥಒ್ಲಥ","ꂧ᷆◞८̯◟ꂧ᷆","૮(ꂧꁞꂧ)ა","(๑≖ิټ≖ิ)","(´⊙ω⊙`)","( ́◞ิ౪◟ิ‵)","ᓀ( ́◒`๑)","(ง ̇∇ ̇)ว(ว ̇∇ ̇)ง"])
    wish_command = {
        '하준이' : "<@!504591246166196234>",
        '정어리' : "<@!653178095100100622>\n정어리... 네 이놈!",
        '굴러' : "데구르르 데굴",
        '오늘은?' : '오늘도 샤키샤키하게...!',
        '.' : ["<@!504591246166196234>","<@!653178095100100622>"]
    }
    command_prefixes = {
        'help' : ["도움말","명령어","help","?","도와줘"],
        'choice' : ["골라","뽑아","chose"],
        '배워' : ["배워","익혀","study"],
        '잊어' : ['잊어',"forget"],
        '구글검색' : ['구글검색','사진검색','사진가져와'],
        '사전검색' : ['사전검색','지식검색','네이버검색'],
        '굴러' : ["구르기","앞구르기","뒷구르기","데굴데굴","굴러","뒹굴뒹굴","rnffj","eprnfmfm","Rhkd"],
        '닉네임' : ["이름","구분"],
        'custom' : ["커스텀","커맨드","사용자지정"],
        'study' : ["공부","스터디","study","learning"],
        'Hello' : ["Hello",'hello','안녕','ㅎㅇ','하이','깔롤랭'],
        '급식' : ['급식','밥','배고파']
    }
    commands = {
        'help' : ["샤키명령어","샤키도움말"]


    }
    study_path = {
        'C' : ["C언어","C","CPP","씨플플","Cpp","c"],
        'python' : ['python',"파이썬","갓이썬","Python"],
        'javascript' : ['javascript','자바스크립트',"자스","JS","js","Js"],
        'html' : ["Html","html","프론트엔드","css","Css","씨에스에스","에이취티엠엘"]
    }
