class Docs:
    help_title = [
        "도움말",
        "굴러",
        "이모지",
        "초대",
        "검색",
        "골라 (1) (2) (3) ...",
        "커스텀 명령어",
        "지워 (숫자)",
        "학교등록 `학교이름의 일부분`",
        "3학년 1반 시간표",
        "급식",
        "주의사항",
        "문의사항 및 건의사항",
    ]
    help_description = [
        """
지금 보고 있는거처럼 명령어 보여주는 바로 이것
        """,
        """
샤키가 데구르르 하는 마술
        """,
        """
샤키가 여러 이모지를 보여줍니다
        """,
        """
샤키를 초대할 수 있는 링크를 보내줍니다        
        """,
        """
**샤키야 사진 (키워드)**
샤키가 사진을 검색합니다.
**샤키야 사전 (키워드)**
샤키가 사전에서 검색합니다.
        """,
        """
args들 중 하나를 랜덤으로 고릅니다.
띄어쓰기로 구분되니 주의해주세요.
        """,
        """
**샤키야 배워 (key command):(value command)**
**샤키야 잊어 (key command)**
**샤키야 (key command)**
이 세가지의 명령어로 샤키 커스텀 명령어를 이용할 수 있습니다.
        """,
        """
n개 만큼 해당 채널의 메세지를 삭제합니다.
        """,
        """
학교 관련 명령어를 쓰기 위해서
당연히 사용해야 하는 그런 것
        """,
        """
학교 시간표를 출력해주지만
간헐적으로 나이스가 지원 안해주는 바로 그것
밥과 마찬가지로 `내일`, `어제` 등의 날짜 수식어 지원
        """,
        """
`샤키야 급식`
해당 명령어는 오늘의 급식들을 보여줍니다.
`샤키야 급식 내일`
해당 명령어는 내일의 급식들을 보여줍니다.

위의 경우들처럼 다양한 일자 처리들을 해줍니다.
        """,
        """
당연하게도 명령어 입력할 때
수식어로 `샤키야` 또는 `ㅅ` 등을 붙여줘야 작동합니다
        """,
        """
**https://github.com/sunrabbit123/Snow_shaki**
해당 레포지토리에 많은 Star 부탁드려요
        """,
    ]
    NH = "후원은 여기로 -> 농협 356-1336-2154-93"
