class Docs:
    help_title = [
        "샤키야 도움말",
        "샤키야 굴러",
        "샤키야 이모지",
        "샤키야 초대",
        "샤키야 검색",
        "샤키야 XXX",
        "샤키야 골라",
        "샤키야 지워",
        "샤키야 급식",
        "문의사항 및 건의사항",
    ]
    help_description = [
        """
지금 보고 있는거처럼 명령어 보여주는 바로 이것
        """,
        """
샤키가 데구르르 하는 마술
        """,
        """
샤키가 여러 이모지를 보여줍니다
        """,
        """
샤키를 초대할 수 있는 링크를 보내줍니다        
        """,
        """
**샤키야 사진 (키워드)**
샤키가 사진을 검색합니다.
**샤키야 사전 (키워드)**
샤키가 사전에서 검색합니다.
        """,
        """
**샤키야 배워 (key command):(value command)**
**샤키야 잊어 (key command)**
**샤키야 (key command)**
이 세가지의 명령어로 샤키 커스텀 명령어를 이용할 수 있습니다.
        """,
        """
**샤키야 골라 (args1) (args2) (args3)**
args들 중 하나를 랜덤으로 고릅니다.
띄어쓰기로 구분되니 주의해주세요.
        """,
        """
**샤키야 지워 n**
n개 만큼 해당 채널의 메세지를 삭제합니다.
        """,
        """
**샤키야 급식**
해당 명령어는 오늘의 급식들을 보여줍니다.
**샤키야 급식 내일**
해당 명령어는 내일의 급식들을 보여줍니다.

위의 경우들처럼 다양한 일자 처리들을 해줍니다.
        """,
        """
**https://github.com/sunrabbit123/Snow_shaki**
해당 레포지토리에 많은 Star 부탁드려요
        """,
    ]
    NH = "후원은 여기로 -> 농협 356-1336-2154-93"
